In [49]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Amit', 'Sita', 'Ravi', 'Amit', np.nan],
    'Age': [25, np.nan, 22, 25, 30],
    'Salary': [50000, 60000, np.nan, 50000, 70000]
}
df=pd.DataFrame(data)
df

   Name   Age   Salary
0  Amit  25.0  50000.0
1  Sita   NaN  60000.0
2  Ravi  22.0      NaN
3  Amit  25.0  50000.0
4   NaN  30.0  70000.0

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      float64
 2   Salary  4 non-null      float64
dtypes: float64(2), object(1)
memory usage: 248.0+ bytes

In [51]:
df.isnull()

    Name    Age  Salary
0  False  False   False
1  False   True   False
2  False  False    True
3  False  False   False
4   True  False   False

In [52]:
df.notnull()

    Name    Age  Salary
0   True   True    True
1   True  False    True
2   True   True   False
3   True   True    True
4  False   True    True

In [53]:
print(df)
print("==================================")
df2=df.dropna()
print(df2)

   Name   Age   Salary
0  Amit  25.0  50000.0
1  Sita   NaN  60000.0
2  Ravi  22.0      NaN
3  Amit  25.0  50000.0
4   NaN  30.0  70000.0
==================================
   Name   Age   Salary
0  Amit  25.0  50000.0
3  Amit  25.0  50000.0

In [54]:
print(df)
print("==================================")
df3=df.fillna(0)
print(df3)

   Name   Age   Salary
0  Amit  25.0  50000.0
1  Sita   NaN  60000.0
2  Ravi  22.0      NaN
3  Amit  25.0  50000.0
4   NaN  30.0  70000.0
==================================
   Name   Age   Salary
0  Amit  25.0  50000.0
1  Sita   0.0  60000.0
2  Ravi  22.0      0.0
3  Amit  25.0  50000.0
4     0  30.0  70000.0

In [55]:
df4=df.replace(25,300)
df4

   Name    Age   Salary
0  Amit  300.0  50000.0
1  Sita    NaN  60000.0
2  Ravi   22.0      NaN
3  Amit  300.0  50000.0
4   NaN   30.0  70000.0

In [56]:
df5=df.fillna(100).replace(100,200)
print(df5)

   Name    Age   Salary
0  Amit   25.0  50000.0
1  Sita  200.0  60000.0
2  Ravi   22.0    200.0
3  Amit   25.0  50000.0
4   200   30.0  70000.0

In [57]:
renamed_df=df.rename(columns={'Salary':'Income'})
print(renamed_df)

   Name   Age   Income
0  Amit  25.0  50000.0
1  Sita   NaN  60000.0
2  Ravi  22.0      NaN
3  Amit  25.0  50000.0
4   NaN  30.0  70000.0

In [58]:
print(df.dtypes)
print("==================================")
df['Age']=df['Age'].astype('int',errors='ignore')
print("==================================")
print(df.dtypes)
print("==================================")
# df['Age']=df['Age'].astype('int') # there is a NaN value in age colum so getting error
# print("==================================")
# print(df.dtypes)
print("========== there is a NaN ========================")
print(df['Age'])
df['Age'].isnull()
print("==================================")
df['Age']=df['Age'].fillna(20)
print(df['Age'])
print("==================================")
df['Age']=df['Age'].astype('int')
print(df.dtypes)

Name       object
Age       float64
Salary    float64
dtype: object
==================================
==================================
Name       object
Age       float64
Salary    float64
dtype: object
==================================
========== there is a NaN ========================
0    25.0
1     NaN
2    22.0
3    25.0
4    30.0
Name: Age, dtype: float64
==================================
0    25.0
1    20.0
2    22.0
3    25.0
4    30.0
Name: Age, dtype: float64
==================================
Name       object
Age         int64
Salary    float64
dtype: object

In [62]:
print(df)
print("==================================")
df6=df.drop_duplicates()
print(df6)

   Name  Age   Salary
0  Amit   25  50000.0
1  Sita   20  60000.0
2  Ravi   22      NaN
3  Amit   25  50000.0
4   NaN   30  70000.0
==================================
   Name  Age   Salary
0  Amit   25  50000.0
1  Sita   20  60000.0
2  Ravi   22      NaN
4   NaN   30  70000.0

In [64]:
print(df)
print("==================================")
df_reset=df.reset_index()
print(df_reset)
print("==================================")
df_reset=df.reset_index(drop=True)
print(df_reset)

   Name  Age   Salary
0  Amit   25  50000.0
1  Sita   20  60000.0
2  Ravi   22      NaN
3  Amit   25  50000.0
4   NaN   30  70000.0
==================================
   index  Name  Age   Salary
0      0  Amit   25  50000.0
1      1  Sita   20  60000.0
2      2  Ravi   22      NaN
3      3  Amit   25  50000.0
4      4   NaN   30  70000.0
==================================
   Name  Age   Salary
0  Amit   25  50000.0
1  Sita   20  60000.0
2  Ravi   22      NaN
3  Amit   25  50000.0
4   NaN   30  70000.0